{
  "project": {
    "name": "Chicken Coop Tycoon - RNG, UI, Combat & Trap Fixes",
    "description": "Bug fixes for egg hatching RNG, inventory UI close button, baseball bat combat, trap visibility in inventory, trap placement, and predator AI improvements.",
    "createdDate": "2026-01-14",
    "priority": "high"
  },
  "mcpInstructions": {
    "description": "Use the Roblox Studio MCP server to interact with Roblox Studio directly for testing and verification.",
    "availableTools": [
      {
        "name": "run_code",
        "description": "Execute Luau code directly in Roblox Studio. Use this to test functionality, query game state, or make runtime changes.",
        "examples": [
          "Test egg hatching RNG: for i = 1, 20 do print(require(game.ReplicatedStorage.Shared.EggConfig).selectHatchOutcome('CommonEgg')) end",
          "Check Tool equipped: print(game.Players:GetPlayers()[1].Character:FindFirstChildOfClass('Tool'))",
          "Test inventory traps: print(#game.Players:GetPlayers()[1].PlayerData.inventory.traps)"
        ]
      },
      {
        "name": "insert_model",
        "description": "Insert a model from the Roblox marketplace into the workspace by searching for it."
      }
    ],
    "workflow": [
      "1. Before implementing a feature, use run_code to understand current game state",
      "2. After making code changes, use run_code to verify the changes work in Roblox Studio",
      "3. Use insert_model if you need placeholder assets for testing",
      "4. Query game objects to ensure proper wiring between client and server"
    ],
    "requirements": [
      "Roblox Studio must be running with the MCP plugin installed",
      "The place file (build.rbxl) should be open in Studio",
      "Studio should be in Edit mode (not Play mode) unless testing runtime behavior"
    ]
  },
  "workItems": [
    {
      "id": 1,
      "category": "RNG-BugFix",
      "title": "Fix Egg Hatching RNG Always Returns Basic Chicken",
      "description": "When hatching a common egg, players always receive a BasicChick instead of getting varied results based on the defined probabilities (70% BasicChick, 25% BrownHen, 5% WhiteHen). The RNG system in EggConfig.selectHatchOutcome() may not be working correctly.",
      "completed": true,
      "priority": "critical",
      "steps": [
        "Review EggConfig.selectHatchOutcome() function and RNG implementation",
        "Check if Random.new() is being seeded properly for varied results",
        "Verify the cumulative probability calculation is correct",
        "Test with multiple hatch attempts to confirm distribution matches expected probabilities",
        "Consider if the rng variable is being reused properly across calls",
        "Check if EggHatching.hatchEgg() is calling selectHatchOutcome() correctly",
        "Add debug logging to track RNG rolls and outcomes",
        "Ensure the Random instance persists and isn't recreated each call"
      ],
      "acceptanceCriteria": [
        "Hatching common eggs produces BasicChick ~70% of the time",
        "Hatching common eggs produces BrownHen ~25% of the time",
        "Hatching common eggs produces WhiteHen ~5% of the time",
        "RNG results are different across game sessions",
        "RNG results are different for each hatch attempt",
        "All egg types produce varied chickens according to their probability tables"
      ],
      "dependencies": [],
      "codeLocations": [
        "src/shared/EggConfig.lua",
        "src/shared/EggHatching.lua"
      ],
      "notes": "The RNG uses Random.new() without a seed which should auto-seed, but verify the rng instance is module-level and persists. Also check if any code path is bypassing selectHatchOutcome() and hardcoding BasicChick."
    },
    {
      "id": 2,
      "category": "UI-BugFix",
      "title": "Fix Inventory Close Button Showing Box Instead of X",
      "description": "The close button on the inventory UI displays a box/square character instead of an X symbol. The current implementation uses the Unicode character '✕' (U+2715) which may not render correctly with the GothamSSm font.",
      "completed": true,
      "priority": "medium",
      "steps": [
        "Review the closeButton creation in InventoryUI.lua around line 631",
        "Change the Text from '✕' to a simpler ASCII 'X' character that renders reliably",
        "Alternatively, use a different Unicode X like '×' (U+00D7) or just uppercase 'X'",
        "Consider using an ImageButton with an X icon image instead of text",
        "Test the fix on both desktop and mobile to ensure it renders correctly",
        "Apply the same fix to any other UI components using special characters for close buttons"
      ],
      "acceptanceCriteria": [
        "Close button displays a clear X symbol, not a box",
        "X symbol is readable and properly styled",
        "Close button is consistent across all platforms (desktop, mobile)",
        "Clicking the close button still closes the inventory"
      ],
      "dependencies": [],
      "codeLocations": [
        "src/client/InventoryUI.lua",
        "src/client/TradeUI.lua",
        "src/client/MobileTouchControls.lua"
      ],
      "notes": "Fixed by replacing '✕' (U+2715) with 'X' in all UI files. The GothamSSm font does not support this character. Applied fix to InventoryUI.lua, TradeUI.lua, and MobileTouchControls.lua."
    },
    {
      "id": 3,
      "category": "Combat-BugFix",
      "title": "Fix Baseball Bat Swing Not Dealing Damage",
      "description": "Players can equip the baseball bat from the hotbar, and a sound effect plays when clicking, but the player character doesn't perform a swing animation and no damage is dealt to predators. The Tool.Activated event handler may be missing or not properly connected to the damage system.",
      "completed": true,
      "priority": "critical",
      "steps": [
        "Review WeaponTool.lua to check if Tool.Activated event is being connected",
        "The create() function creates the Tool but doesn't set up Activated handler",
        "Add Tool.Activated:Connect() handler that triggers swing animation and damage",
        "Check if there's client-side code in Main.client.lua handling weapon activation",
        "Wire the Activated event to call the SwingBat RemoteFunction on the server",
        "Implement swing animation using Roblox's Humanoid:LoadAnimation() or TweenService",
        "Verify BaseballBat.swing() on server properly calculates and applies damage",
        "Check that predators in range are detected and receive damage",
        "Ensure the damage is synchronized between client visual feedback and server state"
      ],
      "acceptanceCriteria": [
        "Clicking while bat is equipped triggers a swing animation",
        "Swing animation is visible to the player and other players",
        "Predators within range (8 studs) take damage when hit",
        "Damage feedback is shown (predator health bar decreases)",
        "Sound effect plays in sync with the swing animation",
        "Cooldown prevents spamming swings (0.5 second cooldown)",
        "Combat works on both desktop (click) and mobile (tap)"
      ],
      "dependencies": [],
      "codeLocations": [
        "src/shared/WeaponTool.lua",
        "src/shared/BaseballBat.lua",
        "src/client/Main.client.lua",
        "src/server/Main.server.lua"
      ],
      "notes": "WeaponTool.create() builds the Tool but never connects Tool.Activated. Need to either add activation handling in WeaponTool or in client code when the tool is given to player. The SwingBat RemoteFunction exists but may not be called."
    },
    {
      "id": 4,
      "category": "Inventory-BugFix",
      "title": "Add Traps Tab to Inventory UI",
      "description": "Traps are not visible in the inventory UI. The current inventory only has tabs for 'eggs' and 'chickens' but no tab for traps. Players who purchase traps cannot see them in their inventory.",
      "completed": true,
      "priority": "high",
      "steps": [
        "Review InventoryUI.lua to understand the tab system",
        "Add 'traps' as a new tab option to the currentTab type definition",
        "Update createTabFrame() to add a third 'Traps' tab button",
        "Create trap item card display similar to eggs/chickens",
        "Add trap-specific information display (type, durability, status)",
        "Update refreshContent() to handle the traps tab",
        "Pull trap data from playerData.traps array",
        "Add 'Place' action button for traps in inventory",
        "Connect trap placement to the PlaceTrap RemoteFunction"
      ],
      "acceptanceCriteria": [
        "Inventory UI shows three tabs: Eggs, Chickens, Traps",
        "Traps tab displays all owned traps with correct details",
        "Trap cards show trap type, rarity/quality, and count (if stacked)",
        "Placed traps show their current status (active, on cooldown, has catch)",
        "Unplaced traps can be selected and placed from inventory",
        "Trap display is consistent with the existing inventory style"
      ],
      "dependencies": [],
      "codeLocations": [
        "src/client/InventoryUI.lua",
        "src/shared/PlayerData.lua",
        "src/shared/TrapConfig.lua"
      ],
      "notes": "The inventory currently only supports 'eggs' | 'chickens' tabs. TrapPlacement.lua has all the trap management functions. PlayerData has traps array that needs to be displayed."
    },
    {
      "id": 5,
      "category": "Placement-Feature",
      "title": "Implement Trap Placement System",
      "description": "There is no way for players to place traps from their inventory into trap spots in their coop. Need to implement a complete trap placement flow similar to chicken/egg placement.",
      "completed": true,
      "priority": "high",
      "steps": [
        "Review how chicken placement works in ChickenPlacement.lua as reference",
        "Create trap placement spots in player sections (up to 8 spots per TrapPlacement.lua)",
        "Add visual indicators for trap placement spots in the game world",
        "Implement client-side trap placement preview when selecting a trap from inventory",
        "Create PlaceTrap handler if not already connected in RemoteSetup",
        "Wire inventory 'Place' button for traps to initiate placement mode",
        "Show available trap spots highlighted when in placement mode",
        "Handle click/tap on trap spot to confirm placement",
        "Call TrapPlacement.placeTrapFromInventory() on server to complete placement",
        "Add visual feedback when trap is successfully placed",
        "Handle edge cases: no available spots, invalid spot selection"
      ],
      "acceptanceCriteria": [
        "Players can select a trap from inventory and enter placement mode",
        "Available trap spots are visually highlighted during placement",
        "Clicking a valid spot places the trap and removes it from inventory",
        "Placed traps are visible in the game world",
        "Traps function correctly once placed (catching predators)",
        "Error messages shown for invalid placement attempts",
        "Placement works on both desktop and mobile"
      ],
      "dependencies": [4],
      "codeLocations": [
        "src/shared/TrapPlacement.lua",
        "src/client/InventoryUI.lua",
        "src/server/Main.server.lua",
        "src/shared/PlayerSection.lua"
      ],
      "notes": "TrapPlacement module exists with full placement logic. The PlaceTrap RemoteFunction is listed in RemoteSetup but may not be fully wired. Need client-side UI for trap spot selection."
    },
    {
      "id": 6,
      "category": "AI-Improvement",
      "title": "Improve Predator AI Behavior",
      "description": "The predator AI is too simple and predictable. Predators should exhibit more intelligent behavior such as: varied approach patterns, flanking, retreating when damaged, prioritizing undefended chickens, and responding to player presence.",
      "completed": false,
      "priority": "medium",
      "steps": [
        "Review current PredatorAI.lua implementation and behavior states",
        "Current states: roaming, stalking, approaching, attacking - expand on these",
        "Add 'fleeing' state when predator takes damage and health is low",
        "Implement 'circling' behavior to approach from different angles",
        "Add player awareness - predators should react to nearby players",
        "Implement target prioritization - prefer isolated/undefended chickens",
        "Add group behavior - multiple predators coordinate attacks",
        "Implement varying aggression levels based on predator type/threat level",
        "Add 'cautious' approach when player has weapon equipped",
        "Improve patrol behavior when at coop - more unpredictable movement",
        "Add retreat logic when shield is activated",
        "Consider line-of-sight mechanics for stalking behavior"
      ],
      "acceptanceCriteria": [
        "Predators exhibit varied approach patterns (not always straight line)",
        "Predators react to player proximity (become cautious or aggressive)",
        "Damaged predators may flee instead of continuing attack",
        "Predators prioritize easier targets (chickens away from player)",
        "Higher threat predators are more aggressive and intelligent",
        "Predators respect shields and avoid shielded areas",
        "AI behavior feels challenging but fair to players",
        "Performance remains good with multiple active predators"
      ],
      "dependencies": [],
      "codeLocations": [
        "src/shared/PredatorAI.lua",
        "src/shared/PredatorConfig.lua",
        "src/shared/PredatorAttack.lua",
        "src/shared/CombatHealth.lua"
      ],
      "notes": "Current AI has roaming, stalking, approaching, attacking states. Consider adding fleeing, circling, coordinating states. Use threat level from PredatorConfig to scale intelligence. Balance difficulty - smarter AI should be more fun, not frustrating."
    }
  ],
  "testingNotes": {
    "description": "General testing guidelines for all work items",
    "steps": [
      "Test RNG by hatching at least 50 eggs and recording results",
      "Verify UI fixes render correctly on different screen sizes",
      "Test combat by engaging predators with the bat",
      "Test trap visibility and placement flow end-to-end",
      "Verify predator AI improvements don't break existing functionality",
      "Test on both desktop and mobile if applicable",
      "Check console for any error messages or warnings",
      "Verify data persistence works correctly after changes"
    ]
  },
  "priorityOrder": [
    "Item 1 (RNG Fix) - Core gameplay mechanic, frustrating when broken",
    "Item 3 (Combat Fix) - Critical for defending against predators",
    "Item 4 (Traps in Inventory) - Required before trap placement",
    "Item 5 (Trap Placement) - Important gameplay feature",
    "Item 2 (Close Button) - UI polish, lower priority",
    "Item 6 (Predator AI) - Enhancement, can be done incrementally"
  ]
}
